# Exercise 4.9 Part 1

## 01 Importing Libraries and Data

In [2]:
import numpy as np 
import pandas as pd
import os

In [3]:
path = r'/Users/brookecoffey/10-07-2023 Instacart Basket Analysis'

In [4]:
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

## 02 Wrangle New Data

In [5]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# renaming column names
customers.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'fam_status' : 'married_status'}, inplace = True)

In [7]:
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,married_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# getting info on each variable's data types
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      194950 non-null  object
 2   last_name       206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int64
 8   married_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [27]:
# changing data type of user_id to str
customers['user_id'] = customers['user_id'].astype(str)

In [29]:
customers['user_id'].dtype

dtype('O')

In [10]:
# checking each variable for data integrity 
customers.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

#### all columns seem to make sense given the context

In [16]:
# Checking frequency of each variable to make sure entries make sense 
customers['age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: age, Length: 64, dtype: int64

In [17]:
customers['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [19]:
customers['married_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: married_status, dtype: int64

In [20]:
customers['gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: gender, dtype: int64

In [21]:
customers['state'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: state, dtype: int64

In [22]:
customers['date_joined'].value_counts(dropna = False)

9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: date_joined, Length: 1187, dtype: int64

In [46]:
# Checking for any null values in the dataframe
customers.isnull().sum()

user_id               0
first_name        11259
last_name             0
gender                0
state                 0
age                   0
date_joined           0
n_dependants          0
married_status        0
income                0
dtype: int64

In [47]:
# looking deeper at the null values in the first_name column 
df_null = customers[customers['first_name'].isnull() == True]

In [48]:
df_null.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,married_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819

In [49]:
df_null.shape

(11259, 10)

In [51]:
# Creating a new dataframe without the null values 
customers_clean = customers[customers['first_name'].isnull() == False]

In [53]:
customers.shape

(206209, 10)

In [52]:
customers_clean.shape

(194950, 10)

### New dataframe correctly excludes the null values in the first_name column

#### There doesn't appear to be any missing data for any of the columns

In [54]:
# Looking for duplicates in customers table
df_dups = customers_clean[customers_clean.duplicated()]

In [55]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, married_status, income]
Index: []

#### Confirming No Duplicates in the final Customer Table

## 03 Importing already-merged order and product data

In [33]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data ', 'Prepared Data ', 'ords_prods_merge_updated2.pkl'))

In [34]:
# Checking existing dataset to confirm it matches the customers dataframe for merging 
ords_prods_merge.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,busiest_day,price_range,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_days_since_prior_order,frequency_tag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Regularly busy,Mid-range product,Regularly busy,Fewest orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Regularly busy,Mid-range product,Least busy,Fewest orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Regularly busy,Mid-range product,Least busy,Most orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Least busy,Mid-range product,Least busy,Fewest orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Least busy,Mid-range product,Least busy,Most orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer

In [35]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 27 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        int64
 2   eval_set                       object
 3   order_number                   int64
 4   order_dow                      int64
 5   order_hour_of_day              int64
 6   days_since_prior_order         float64
 7   product_id                     int64
 8   add_to_cart_order              int64
 9   reordered                      int64
 10  Unnamed: 0                     int64
 11  product_name                   object
 12  aisle_id                       int64
 13  department_id                  int64
 14  prices                         float64
 15  _merge                         category
 16  price_range_loc                object
 17  busiest_day                    object
 18  price_range                    object
 19  busiest_days                   object
 20  busiest_period_of_day          object
 21  max_order                      int64
 22  loyalty_flag                   object
 23  avg_order_price                float64
 24  spending_flag                  object
 25  median_days_since_prior_order  float64
 26  frequency_tag                  object
dtypes: category(1), float64(4), int64(12), object(10)
memory usage: 6.5+ GB

In [36]:
# Changing data type of user_id to string to match the customers dataframe
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype(str)

In [37]:
ords_prods_merge['user_id'].dtype

dtype('O')

In [42]:
# Dropping unnecessary columns from the existing dataframe
ords_prods_merge = ords_prods_merge.drop(columns = ['Unnamed: 0', '_merge'])

In [43]:
ords_prods_merge.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,busiest_day,price_range,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_days_since_prior_order,frequency_tag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Regularly busy,Mid-range product,Regularly busy,Fewest orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Regularly busy,Mid-range product,Least busy,Fewest orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Regularly busy,Mid-range product,Least busy,Most orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Least busy,Mid-range product,Least busy,Fewest orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Least busy,Mid-range product,Least busy,Most orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent Customer

In [56]:
ords_prods_merge.rename(columns = {'order_dow' : 'order_day_of_week'}, inplace = True)

In [59]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        object
 2   order_number                   int64
 3   order_day_of_week              int64
 4   order_hour_of_day              int64
 5   days_since_prior_order         float64
 6   product_id                     int64
 7   add_to_cart_order              int64
 8   reordered                      int64
 9   product_name                   object
 10  aisle_id                       int64
 11  department_id                  int64
 12  prices                         float64
 13  price_range_loc                object
 14  busiest_day                    object
 15  price_range                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int64
 19  loyalty_flag                   object
 20  avg_order_price                float64
 21  spending_flag                  object
 22  median_days_since_prior_order  float64
 23  frequency_tag                  object
dtypes: float64(4), int64(10), object(10)
memory usage: 6.0+ GB

## 04 Merging Customer dataframe with merged order and product data

In [61]:
df_total_merge = customers_clean.merge(ords_prods_merge, on = 'user_id', indicator = True)

In [62]:
df_total_merge.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,married_status,income,...,price_range,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_days_since_prior_order,frequency_tag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Busiest day,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular Customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular Customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Busiest day,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular Customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular Customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Least busy,Most orders,8,New customer,7.988889,Low Spender,19.0,Regular Customer,both

In [64]:
df_total_merge.shape

(30629741, 34)

In [65]:
df_total_merge['_merge'].value_counts()

both          30629741
left_only            0
right_only           0
Name: _merge, dtype: int64

In [66]:
# Every record was merged, drop the _merge column 
df_total_merge_clean = df_total_merge.drop(columns = '_merge')

In [67]:
df_total_merge_clean.shape

(30629741, 33)

## Final Data Set looks clean!

# 05 Exporting data

In [74]:
df_total_merge_clean.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_customers.pkl'))